[
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Travis-scott-sicko-mode-lyrics",
    "lyrics": "931 Contributors\nTranslations\nEspañol\nPortuguês\nРусский (Russian)\nTürkçe\nFrançais\nDeutsch\nItaliano\nSICKO MODE Lyrics\n“SICKO MODE” refers to Travis and Drake’s work ethic, showing they’re a cut above the competition by going into “sicko” or “beast” mode.\n\n“Sicko,” or “6icko” (the 6 referring to Drake’s hometown Toronto), is… \nRead More\n \n[Part I]\n[Intro: Drake]\nAstro, yeah\n[Verse: Drake]\nSun is down, freezin' cold\nThat's how we already know, winter's here\nMy dawg would probably do it for a Louis belt\nThat's just all he know, he don't know nothin' else\nI tried to show 'em, yeah\nI tried to show 'em, yeah, yeah\nYeah, yeah, yeah\nGoin' on you with the pick and roll\nYoung La Flame, he in sicko mode\n[Part II]\n[Verse 1: Travis Scott & \nThe Notorious B.I.G\n.\n]\n(Woo) Made this here with all the ice on in the booth\nAt the gate outside, when they pull up, they get me loose\nYeah, Jump Out boys, that's Nike boys, hoppin' out coupes\nThis shit way too big, when we pull up, give me the loot (\nGimme the loot!\n)\nWas off the Remy, had a Papoose\nHad to hit my old town to duck the news\nTwo-four hour lockdown, we made no moves\nNow it's 4 a.m. and I'm back up poppin' with the crew\nI just landed in, Chase B mixes pop like Jamba Juice\nDifferent colored chains, think my jeweler really sellin' fruits\nAnd they chokin', man, know the crackers wish it was a noose\n[Refrain: Big Hawk & \nSwae Lee\n]\nSome-some-some-someone said\nTo win the retreat, we all in too deep\nPlay-play-playin' for keeps, don't play us for weak (\nSomeone said\n)\nTo win the retreat, we all in too deep\nPlay-play-playin' for keeps, don't play us for weak\n[Verse 2: Travis Scott & \nUncle Luke\n]\nYeah, this shit way too formal, y'all know I don't follow suit\nStacey Dash, most of these girls ain't got a clue\nAll of these hoes I made off records I produced\nI might take all my exes and put 'em all in a group\nHit my eses, I need the bootch\n'Bout to turn this function to Bonnaroo\nTold her, \"Hop in, you comin' too\"\nIn the 305, bitches treat me like I'm Uncle Luke\n(\nDon't stop, pop that pussy!\n)\nHad to slop the top off, it's just a roof, uh\nShe said, \"Where we goin'?\" I said, \"The moon\"\nWe ain't even make it to the room\nShe thought it was the ocean, it's just the pool\nNow I got her open, it's just the Goose\nWho put this shit together? I'm the glue\n[Refrain: Travis Scott, \nSwae Lee\n & \nBig Hawk\n]\nSomeone said\nShorty FaceTimed me out the blue\nSomeone said\nPlay-playin' for keeps\nSomeone said, mother****, someone said\nDon't play us for weak\n[Part III]\n[Intro: Travis Scott, \nDrake\n & \nLil Juice\n]\nYeah\nAstro, yeah, yeah\n(\nTay Keith, fuck these niggas up\n)\nAyy, ayy\n[Chorus: Drake & \nTravis Scott\n]\nShe's in love with who I am\nBack in high school, I used to bus it to the dance (\nYeah\n)\nNow I hit the FBO with duffels in my hands\nI did half a Xan, thirteen hours 'til I land\nHad me out like a light, ayy, yeah\nLike a light, ayy, yeah\n[Verse 1: Drake & \nTravis Scott\n]\nLike a light, ayy, slept through the flight, ayy\nKnocked for the night, ayy\n767, man, this shit got double bedroom, man\nI still got scores to settle, man\nI crept down the block (Down the block)\nMade a right (Yeah, right)\nCut the lights (Yeah, what?), paid the price (Yeah)\nNiggas think it's sweet (Nah, never), it's on sight (Yeah, what?)\nNothin' nice (Yeah), baguettes in my ice (Aw, man)\nJesus Christ (Yeah), checks over stripes (Yeah)\nThat's what I like (\nYeah\n), that's what we like (\nYeah\n)\nLost my respect, you not a threat\nWhen I shoot my shot, that shit wetty like I'm Sheck (\nBitch\n)\nSee the shots that I took (Ayy), wet like I'm Book (Ayy)\nWet like I'm Lizzie\nI be spinnin' Valley, circle blocks 'til I'm dizzy (Yeah, what?)\nLike where is he? (Yeah, what?)\nNo one seen him (Yeah, yeah)\nI'm tryna clean 'em (Yeah)\n[Chorus: Drake & \nTravis Scott\n]\nShe's in love with who I am\nBack in high school, I used to bus it to the dance\nNow I hit the FBO with duffels in my hands (\nWoo\n)\nI did half a Xan, thirteen hours 'til I land\nHad me out like a light (\nLike a light\n)\nLike a light (\nLike a light\n)\nLike a light (\nLike a light\n)\nLike a light\n[Verse 2: Travis Scott]\nYeah, passed the dawgs a celly\nSendin' texts, ain't sendin' kites, yeah\nHe said, \"Keep that on lock\"\nI say, \"You know this shit, it's stife,\" yeah\nIt's absolute, yeah (Yeah), I'm back, reboot (It's lit)\nLaFerrari to Jamba Juice, yeah (Skrrt, skrrt)\nWe back on the road, they jumpin' off, no parachute, yeah\nShorty in the back\nShe said she workin' on her glutes, yeah (Oh my God)\nAin't by the book, yeah, this how it look, yeah\n'Bout a check, yeah (Check), just check the foots, yeah\nPass this to my daughter, I'ma show her what it took (Yeah)\nBaby mama cover \nForbes\n, got these other bitches shook\nYeah"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-gods-plan-lyrics",
    "lyrics": "676 Contributors\nTranslations\nРусский (Russian)\nTürkçe\nEspañol\nPolski\nItaliano\nDeutsch\nFrançais\nazərbaycan\nGod’s Plan Lyrics\n“God’s Plan” is a feel-good track that discusses Drake’s future. Being who he is in the industry, he knows that people want him to fail; however, God won’t let him do that.\n\nAnother key subject of the song is… \nRead More\n \n[Intro]\nAnd they wishin' and wishin'\nAnd wishin' and wishin', they wishin' on me\nYeah\n[Verse 1]\nI been movin' calm, don't start no trouble with me\nTryna keep it peaceful is a struggle for me\nDon't pull up at 6 a.m. to cuddle with me\nYou know how I like it when you lovin' on me\nI don't wanna die for them to miss me\nYes, I see the things that they wishin' on me\nHope I got some brothers that outlive me\nThey gon' tell the story, shit was different with me\n[Pre-Chorus]\nGod's plan, God's plan\nI hold back, sometimes, I won't, yeah\nI feel good, sometimes, I don't (Ayy, don't)\nI finessed down Weston Road (Ayy, 'nessed)\nMight go down a G-O-D (Yeah, wait)\nI go hard on Southside G (Yeah, wait)\nI make sure that north-side eat\nAnd still\n[Chorus]\nBad things\nIt's a lot of bad things that they wishin' and wishin'\nAnd wishin' and wishin', they wishin' on me\nBad things\nIt's a lot of bad things that they wishin' and wishin'\nAnd wishin' and wishin', they wishin' on me\nYeah, ayy, ayy\n[Verse 2]\nShe say, \"Do you love me?\" I tell her, \"Only partly\nI only love my bed and my mama, I'm sorry\"\nFifty Dub, I even got it tatted on me\nEighty-one, they'll bring the crashers to the party\nAnd you know me\nTurn the O2 into the O3, dog\nWithout 40, Oli, there'd be no me\n'Magine if I never met the broskies\n[Pre-Chorus]\nGod's plan, God's plan\nI can't do this on my own, ayy (No, ayy)\nSomeone watchin' this shit close (Yep, close)\nI've been me since Scarlett Road, ayy (Road, ayy)\nMight go down as G-O-D (Yeah, wait, yeah)\nI go hard on Southside G (Ayy, wait, ayy)\nI make sure that north-side eat, yeah\nAnd still\n[Chorus]\nBad things\nIt's a lot of bad things that they wishin' and wishin'\nAnd wishin' and wishin', they wishin' on me\nYeah, yeah\nBad things\nIt's a lot of bad things that they wishin' and wishin'\nAnd wishin' and wishin', they wishin' on me\nYeah"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Rihanna-work-lyrics",
    "lyrics": "345 Contributors\nTranslations\nEspañol\nDeutsch\nFrançais\nPolski\nEnglish\nWork Lyrics\nOn “Work,” Rihanna seeks a deep, meaningful connection, however, the male character she sings to (played by Drake) is only interested in sex. This narrative is similar to Rihanna and Drake’s previous… \nRead More\n \n[Chorus: Rihanna]\nWork, work, work, work, work, work\nHe said me haffi work, work, work, work, work, work\nHe see me do mi dirt, dirt, dirt, dirt, dirt, dirt\nAh so me put in work, work, work, work, work, work\nWhen you ah guh learn, learn, learn, learn, learn, learn?\nMe nuh cyar if him hurt, hurt, hurt, hurt, hurting\n[Verse 1: Rihanna]\nDry, me ah desert him\nNuh time to have you lurking\nHim ah go act like he nuh like it\nYou know I dealt with you the nicest\nNuh body touch me, you nuh righteous\nNuh badda, text me in a crisis\nI believed all of your dreams, adoration\nYou took my heart and my keys and my patience\nYou took my heart on my sleeve for decoration\nYou mistaken my love I brought for you for foundation\nAll that I wanted from you was to give me\nSomething that I never had\nSomething that you've never seen\nSomething that you've never been, mm\nBut I wake up and act like nothing's wrong\n[Chorus: Rihanna]\nJust get ready fi work, work, work, work, work, work\nHe said me haffi work, work, work, work, work, work\nHe see me do mi dirt, dirt, dirt, dirt, dirt, dirt\nAh so me put in work, work, work, work, work, work\nNer, ner, ner, ner, ner, ner\nWhen you ah guh learn, learn, learn, learn, learn, learn?\nBefore the tables turn, turn, turn, turn, turn, turn\n[Verse 2: Rihanna]\nBeg you something, please\nBaby, don't you leave\nDon't leave me stuck here in the streets, uh-huh\nIf I get another chance to\nI will never, no, never neglect you\nI mean, who am I to hold your past against you?\nI just hope that it gets to you\nI hope that you see this through\nI hope that you see this true\nWhat can I say?\nPlease recognize I'm tryin', babe\n[Chorus: Rihanna & \nDrake\n]\nI haffi work, work, work, work, work, work\nHe said me haffi work, work, work, work, work, work\nHe see me do mi dirt, dirt, dirt, dirt, dirt, dirt\nSo me put in work, work, work, work, work, work\nWhen you ah guh learn, learn, learn, learn, learn, learn?\nMe nuh cyar if him hurt, hurt, hurt, hurt, hurting (\nYeah, okay\n)\n[Verse 3: Drake, \nRihanna\n, \nDrake & Rihanna\n]\nYou need to get done, done, done, done at work, come over\nWe just need to slow the motion\nDon't give that away to no one\nLong distance, I need you (\nAh\n)\nWhen I see potential, I just gotta see it through\nIf you had a twin, I would still choose you\nI don't wanna rush into it if it's too soon\nBut I \nknow you need to get done, done, done, done\nIf you come over\nSorry if I'm way less friendly\nI got niggas tryna end me, oh (Yeah)\nI spilled all my emotions tonight, I'm sorry\nRollin', rollin', rollin', rollin', rollin'\nHow many more shots until you're rollin'?\nWe just need a face-to-face\nYou could pick the time and the place\nYou spent some time away\nNow you need to forward\n[Chorus: Rihanna, \nRihanna & Drake\n]\nAnd give me all the work, work, work, work, work\n, work\nHe said me haffi \nwork, work, work, work, work, work\nHe see me do mi dirt, dirt, dirt, dirt, dirt, dirt\nSo me put in work, work, work, work, work, work\nWhen you ah guh learn, learn, learn, learn, learn, learn?\nMe nuh cyar if him hurt, hurt, hurt, hurt, hurting\n[Outro: Rihanna, \nRihanna & Drake\n]\nMm\nMm\nWork, work, work, work, work, work\nMm\n[Click here to learn more about the making of \"Work\"]\n[Produced by Boi-1da]"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/A-ap-rocky-fuckin-problems-lyrics",
    "lyrics": "515 Contributors\nTranslations\nРусский (Russian)\nEspañol\nPortuguês\nFrançais\nPolski\nDeutsch\nFuckin’ Problems Lyrics\nThis all-star posse cut showcases three distinctive rappers trying to out-stunt each other on the subject of fucking “bad bitches.” Rocky called the song a “reunion” of Drake’s 2012 Club Paradise Tour, which… \nRead More\n \n[Chorus: 2 Chainz, \nDrake\n, \n2 Chainz & Drake\n, \nA$AP Rocky\n]\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem\n (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem\n (Problem)\nIf findin' somebody real is your fuckin' problem\n (\nYeah\n)\nBring your girls to the crib, maybe we can solve it, ayy\n[Verse 1: A$AP Rocky]\nHold up, bitches, simmer down (Uh)\nTakin' hella long, bitch, give it to me now (Uh)\nMake that thing pop like a semi or a nine\nOoh, baby like it raw with the shimmy shimmy ya, huh?\nA$AP (Yeah), get like me (Uh)\nNever met a motherfucker fresh like me (Yeah)\nAll these motherfuckers wanna dress like me (Uh)\nBut the chrome to your dome make you sweat like Keith\n‘Cause I'm the nigga, the nigga, nigga, like how you figure? (Yeah)\nGettin' figures and fuckin' bitches\n, \nshe rollin' Swishers\nBrought her bitches, I brought my niggas (Uh)\nThey gettin' bent up off the liquor (Uh)\nShe love my licorice, I let her lick it (Alright)\nThey say money make a nigga act niggarish (Uh)\nBut least a nigga, nigga rich\nI be fuckin' broads like I be fuckin' bored\nTurn a dyke bitch out, have her fuckin' boys, beast\n (Hahahahaha)\n[Chorus: 2 Chainz, \nDrake\n, \n2 Chainz & Drake\n]\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem\n (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem\n (Problem)\nIf findin' somebody real is your fuckin' problem\nBring your girls to the crib, maybe we can solve it, ayy\n[Verse 2: Drake]\nOoh, I know you love it when this beat is on\nMake you think about all of the niggas you been leadin' on\nMake me think about all of the rappers I've been feedin' on\nGot a feelin' that's the same dudes that we speakin' on, oh word?\nAin't heard my album? Who you sleepin' on?\nYou should print the lyrics out and have a fuckin' read-along\nAin't a fuckin' sing-along 'less you brought the weed along\nThen ju— okay, I got it\nThen just drop down and get your eagle on\nOr we can stare up at the stars and put the Beatles on\nAll that shit you talkin' 'bout is not up for discussion\nI will pay to make it bigger, I don't pay for no reduction\nIf it's comin' from a nigga I don't know, then I don't trust it\nIf you comin' for my head, then motherfucker, get to bustin'\nYes, Lord\n, \nI don't really say this often\nBut this long-dick nigga ain't for the long talkin'\n, \nI'm beast\n[Chorus: 2 Chainz, \nDrake\n, \n2 Chainz & Drake\n]\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem\n (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem\n (Problem)\nIf findin' somebody real is your fuckin' problem\nBring your girls to the crib, maybe we can solve it\n[Verse 3: Kendrick Lamar]\nUh, yeah, ho, this the finale\nMy pep talk turn into a pep rally\nSay she from the hood, but she live inside in the valley now\nVacayed in Atlanta, then she goin' back to Cali (Mm)\nGot your girl on my line, world on my line\nThe irony, I fuck 'em at the same damn time\nShe eyein' me like a nigga don't exist\nGirl, I know you want this dick\nGirl, I'm Kendrick Lamar (Mm)\nA.K.A. Benz is to me just a car (Mm)\nThat mean your friends-es need be up to par\nSee, my standards are pampered by threesomes tomorrow (Mm)\nKill 'em all, dead bodies in the hallway\nDon't get involved, listen what the crystal ball say\nHalle Berry, hallelujah\nHoller back, I'll do ya, beast\n[Chorus: 2 Chainz, \nDrake\n, \n2 Chainz & Drake\n]\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem (Problem)\nI love bad bitches, that's my fuckin' problem\n (Problem)\nAnd yeah, I like to fuck, I got a fuckin' problem\n (Problem)\nIf findin' somebody real is your fuckin' problem\nBring your girls to the crib, maybe we can solve it, ayy\n[Produced by 40 & Drake]"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-in-my-feelings-lyrics",
    "lyrics": "385 Contributors\nTranslations\nไทย (Thai)\nPortuguês\nEspañol\nDeutsch\nIn My Feelings Lyrics\n“In My Feelings” is an upbeat, club-mixed love letter to “Kiki,” “KB,” and the members of City Girls. The track rides on Drake’s heartfelt singing and honest lyrics, wondering if they still love him.\n\nThe… \nRead More\n \n[Intro: Drake]\nTrap, TrapMoneyBenny\nThis shit got me in my feelings\nGotta be real with it, yeah\n[Chorus: Drake]\nKiki, do you love me? Are you riding?\nSay you'll never ever leave from beside me\n'Cause I want ya, and I need ya\nAnd I'm down for you always\nKB, do you love me? Are you riding?\nSay you'll never ever leave from beside me\n'Cause I want ya, and I need ya\nAnd I'm down for you always\n[Verse: Drake]\nLook, the new me is really still the real me\nI swear you gotta feel me before they try and kill me\nThey gotta make some choices, they runnin' out of options\n'Cause I've been goin' off and they don't know when it's stoppin'\nAnd when you get to toppin', I see that you've been learnin'\nAnd when I take you shoppin', you spend it like you earned it\nAnd when you popped off on your ex, he deserved it\nI thought you were the one from the jump, that confirmed it\nTrapMoneyBenny, ayy\nI buy you Champagne but you love some Henny\nFrom the block like you Jenny\nI know you special, girl, 'cause I know too many\n[Chorus: Drake]\n'Resha, do you love me? Are you riding?\nSay you'll never ever leave from beside me\n'Cause I want ya, and I need ya\nAnd I'm down for you always\nJT, do you love me? Are you riding?\nSay you'll never ever leave from beside me\n'Cause I want ya, and I need ya\nAnd I'm down for you always\n[Interlude: JT, \nYung Miami\n, \nDrake\n & \nMagnolia Shorty\n]\nTwo bad bitches and we kissin' in the Wraith\nKissin'-kissin' in the Wraith, kiss-kissin' in the Wraith\nI need that black card and the code to the safe\nCode to the safe, code-code to the safe-safe\nI show him how that neck work\nFuck that Netflix and chill, what's your net-net-net worth?\n'Cause I want ya, and I need ya\nAnd I'm down for you always\nYeah, yeah, yeah, yeah, he bad\nAnd I'm down for you always\nYeah, yeah, yeah, guess who's back\nAnd I'm down for you always\nD-down for you al–\nBlack biggy biggy black biggy black blake\nD-d-down for you always\nI got a new boy, and that nigga trade\n[Chorus: Drake]\nKiki, do you love me? Are you riding?\nSay you'll never ever leave from beside me\n'Cause I want you, and I need you\nAnd I'm down for you always\nKB, do you love me? Are you riding?\nSay you'll never ever leave from beside me\n'Cause I want ya, and I–\n[Breakdown: Lil Wayne & \nMagnolia Shorty\n]\nSkate and Smoke and Rap\nNow let me see you\nBring that ass, bring that ass, bring that ass back\nB-bring that ass, bring that ass, bring that ass back\nShawty say the nigga that she with can't hit\nBut shawty, I'ma hit it, hit it like I can't miss\nNow let me see you\nClap that ass, you're the only one I love\nClap that ass, clap-clap that ass\nBring that ass back\nClap-clap-clap that ass, you're the only one I love\nLet's go, let's go, let's go\nBring that ass back\n[Outro: Drake]\nTrap, TrapMoneyBenny\nThis shit got me in my feelings\nGotta be real with it, ayy, yup\n(\nBlaqNmilD, you a genius, you diggin' me?\n)\n[Skit: Zazie Beetz]\nYou know what, I don't even care, I need a photo with Drake\nBecause my Instagram is weak as fuck\nI'm just being real, my shit, look—"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-hotline-bling-lyrics",
    "lyrics": "329 Contributors\nTranslations\nTürkçe\nEspañol\nPortuguês\nFrançais\nDeutsch\nHotline Bling Lyrics\n“Hotline Bling” is most likely about Drake’s old flame from Toronto, Nebby. She’s had an on and off relationship with the 6 God a few times, and her Instagram account is a constant reminder that she’s never… \nRead More\n \n[Intro]\nYou used to call me on my\nYou used to, you used to\nYeah\n[Chorus]\nYou used to call me on my cell phone\nLate-night when you need my love\nCall me on my cell phone\nLate-night when you need my love\nAnd I know when that hotline bling\nThat can only mean one thing\nI know when that hotline bling\nThat can only mean one thing\n[Verse 1]\nEver since I left the city, you\nGot a reputation for yourself now\nEverybody knows and I feel left out\nGirl, you got me down, you got me stressed out\n'Cause ever since I left the city, you\nStarted wearin' less and goin' out more\nGlasses of champagne out on the dance floor\nHangin' with some girls I never seen before\n[Chorus]\nYou used to call me on my cell phone\nLate-night when you need my love\nCall me on my cell phone\nLate-night when you need, my love\nI know when that hotline bling\nThat can only mean one thing\nI know when that hotline bling\nThat can only mean one thing\n[Verse 2]\nEver since I left the city, you, you, you\nYou and me, we just don't get along\nYou make me feel like I did you wrong\nGoin' places where you don't belong\nEver since I left the city, you\nYou got exactly what you asked for\nRunnin' out of pages in your passport\nHangin' with some girls I've never seen before\n[Chorus]\nYou used to call me on my cell phone\nLate-night when you need my love\nCall me on my cell phone\nLate-night when you need, my love\nAnd I know when that hotline bling\nThat can only mean one thing\nI know when that hotline bling\nThat can only mean one thing\n[Bridge]\nThese days, all I do is\nWonder if you're bendin' over backwards for someone else\nWonder if you're rollin' up a Backwoods for someone else\nDoing things I taught you, gettin' nasty for someone else\nYou don't need no one else\nYou don't need nobody else, no\nWhy you never alone?\nWhy you always touchin' road?\nUsed to always stay at home\nBe a good girl, you was in the zone\nYeah, you should just be yourself\nRight now, you're someone else\n[Chorus]\nYou used to call me on my cell phone\nLate-night when you need my love\nCall me on my cell phone\nLate-night when you need my love\nAnd I know when that hotline bling\nThat can only mean one thing\nI know when that hotline bling\nThat can only mean one thing\n[Outro]\nEver since I left the city—\n[Produced by Nineteen85]"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-one-dance-lyrics",
    "lyrics": "312 Contributors\nTranslations\nTürkçe\nEspañol\nPolski\nDeutsch\nFrançais\nРусский (Russian)\nOne Dance Lyrics\n“One Dance” is an R&B song with dancehall and Afrobeats inflections, featuring a slowed down sample of the vocals and chord stabs from a 2008 UK Funky house anthem, Kyla’s “Do You Mind,” produced by Crazy… \nRead More\n \n[Refrain: Kyla]\nBaby, I like your style\n[Verse 1: Drake]\nGrips on your waist, front way, back way\nYou know that I don't play\nStreets not safe but I never run away\nEven when I'm away\nOti, oti\nThere's never much love when we go OT\nI pray to make it back in one piece\nI pray, I pray\n[Chorus: Drake]\nThat's why I need a one dance\nGot a Hennessy in my hand\nOne more time 'fore I go\nHigher powers taking a hold on me\nI need a one dance\nGot a Hennessy in my hand\nOne more time 'fore I go\nHigher powers taking a hold on me\n[Refrain: Kyla]\nBaby, I like your style\n[Verse 2: Drake]\nStrength and guidance\nAll that I'm wishing for my friends\nNobody makes it from my ends\nI had to bust up the silence\nYou know you gotta stick by me\nSoon as you see the text, reply me\nI don't wanna spend time fighting\nWe've got no time, and that's why\n[Chorus: Drake]\nI need a one dance\nGot a Hennessy in my hand\nOne more time 'fore I go\nHigher powers taking a hold on me\nI need a one dance\nGot a Hennessy in my hand\nOne more time 'fore I go\nHigher powers taking a hold on me\n[Post-Chorus: Wizkid]\nGot a pretty girl and she love me long time\nFine like a wine, she love me long time\nOh, yeah, very long time\nBack up, back up, back up, and whine it\nBack up, back up, and whine it\nGirl, just back up, back up, back up, and whine, girl\nOh, yes, steady and fine\nBack, up, back up and whine it, mm\n[Bridge: Kyla]\nOh, tell me, I need to know\nWhere do you wanna go?\n'Cause if you're down, I'll take it slow\nMake you lose control\n[Breakdown: Kyla & \nWizkid\n]\nWhere, where, where\nWhere, where, where, where \n(\nOh, yeah, very long time\n)\nWhere, where, where \n(\nBack up, back up, and wine am, girl\n)\nWhere, where, where, where\n'Cause if you're down \n(\nBack up, back up, and–\n)\n'Cause if you're down \n(\nBack up, back up, and–\n)\n'Cause if you're down \n(\nBack up, back up, and–\n)\n[Chorus: Drake & \nKyla\n]\nI need a one dance (\nWhere, where, where\n)\nGot a Hennessy in my hand (\nWhere, where, where, where\n)\nOne more time 'fore I go (\nWhere\n)\nHigher powers taking a hold on me (\nWhere, where, where, where\n)\nI need a one dance\nGot a Hennessy in my hand\nOne more time 'fore I go\nHigher powers taking a hold on me\n[Outro]\nHow do you spell \"Hennessy?\"\nI put two \"N\"s and two \"S\"es, is it like that? Hen... Henn... Henn...\nIt's definitely not showing up\nI know \"Hennessy\" has two \"S\"es for sure, so I'm gonna take out one of the \"N\"s"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-hold-on-were-going-home-lyrics",
    "lyrics": "230 Contributors\nTranslations\nEspañol\nFrançais\nHold On, We’re Going Home Lyrics\nDrake’s single isn’t a rap song as we all know, but here’s the rapper-singer reiterating the fact for all us: Drizzy says him and Noah “40” Shebib “wanted to channelize the Michael Jackson-Quincy Jones sound… \nRead More\n \n[Verse: Drake]\nI got my eyes on you\nYou're everything that I see\nI want your heart, love and emotion endlessly\nI can't get over you\nYou left your mark on me\nI want your hot love and emotion endlessly\n[Pre-Chorus: Drake]\n'Cause you're a good girl and you know it\nYou act so different around me\n'Cause you're a good girl and you know it\nI know exactly who you could be\n[Chorus: Drake]\nJust hold on, we're going home\nJust hold on, we're going home\nIt's hard to do these things alone\nJust hold on, we're going home\nHome\n[Verse: Drake]\nI got my eyes on you\nYou're everything that I see\nI want your heart, love and emotion endlessly\nI can't get over you\nYou left your mark on me\nI want your hot love and emotion endlessly\n[Pre-Chorus: Drake & \nMajid Al Maskati\n]\n'Cause you're a good girl and you know it (\nOh yeah\n)\nYou act so different around me (\nAh-ah, da-da\n)\n'Cause you're a good girl and you know it (\nAh-ah-ah\n)\nI know exactly who you could be\n[Chorus: Drake & \nMajid Al Maskati\n]\nSo just hold on, we're going home (\nGoing home\n)\nJust hold on, we're going home (\nGoing home\n)\nIt's hard to do these things alone (\nThings alone\n)\nJust hold on, we're going home (\nGoing home\n)\nHome (\nGoing home\n)\n[Bridge: Majid Al Maskati & \nDrake\n]\nYou're the girl, you're the one\nGave you everything I loved\nI think there's something, baby\nI think there's something, baby\nYou're the girl, you're the one\nGave you everything I loved (\nOh\n)\nI think there's something, baby\nI think there's something, baby\n[Pre-Chorus: Drake & \nMajid Al Maskati\n]\n'Cause you're a good girl and you know it\nYou act so different around me\n'Cause you're a good girl and you know it\nI know exactly who you could be\n[Chorus: Drake & \nMajid Al Maskati\n]\nOh, just hold on, we're going home (\nGoing home\n)\nJust hold on, we're going home (\nGoing home\n)\nIt's hard to do these things alone (\nThings alone\n)\nJust hold on, we're going home (\nGoing home\n)\nHome (\nGoing home\n)\n[Outro: Majid Al Maskati]\n(Hold on)\n(Oh, oh)\n[Produced by Nineteen85, Majid Jordan & Noah \"40\" Shebib]"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-know-yourself-lyrics",
    "lyrics": "297 Contributors\nTranslations\nTürkçe\nEspañol\nPortuguês\nPolski\nKnow Yourself Lyrics\nDrake first used the phrase “know yourself” in “Jodeci Freestyle” – a single released in the lead-up to his album Nothing Was The Same. On the album, the phrase is also referenced in “From Time,” during a… \nRead More\n \n[Part I]\n[Intro]\nHol' it yute, hol' it, hol' it, hol' it, hol' it, hol' it\nNo sleepin' in the streets!\nShaky warrior\nYeah, this that Oliver, 40, Niko shit man\n15 Fort York shit, y'know?\nBoi-1da, what's poppin'?\nYeah, yeah\n[Verse 1]\nRunnin' through the 6 with my woes\nCountin' money, you know how it goes\nPray the real live forever, man\nPray the fakes get exposed\nI want that Ferrari, then I swerve\nI want that Bugatti, just to hurt\nI ain't rockin' my jewelry, that's on purpose\nNiggas want my spot and don't deserve it\nI don't like how serious they take themselves\nI've always been me, I guess I know myself\nShakiness, man, I don't have no time for that\nMy city too turned up, I'll take the fine for that\nThis been where you find me at\nThat's been where you find me at\nI know a nigga named Johnny Bling\nHe put me on to the finer things\nHad a job sellin' Girbaud jeans\nI had a yellow TechnoMarine\nThen Kanye dropped, it was polos and backpacks\nMan, that was when Ethan was pushin' a Subaru hatchback\nMan, I'm talkin' way before hashtags\nI was runnin' through the 6 with my woes\n(Yeah!)\n[Part II]\n[Chorus]\nI was runnin' through the 6 with my woes\nYou know how that shit go\nYou know how that shit go\nYou know how that shit go\nRunnin' through the 6 with my woes\nYou know how that shit go\nYou know how that shit go\nYou know how that shit go\nDon't fuck with them niggas, they too irrational, woah\n[Verse 2]\nThis is that nasty flow\nTop boy in this shit, I'm so international\nReps up is in here\nGot P Reign and Chubby and TJ and Winnie and woah\nYeah, and you know how that shit go\nI might declare it a holiday as soon as Baka get back on the road\nYeah, but you know how that shit go\nThey so irrational, they don't wanna patch it up\nThey wanna mash it up, woah\nMy nigga Jibba, he whip it, I ride in the passenger\nI'm way up, I stay up, I'm two up, I'm three up\nI had to get back to you, woah\nI'm turnin' into a nigga that thinks about money and women\nLike 24/7, that's where my life took me\nThat's just how shit happened to go\nAnd you know\nRunnin' through the 6 with my, with my\n[Chorus]\nI was running through the 6 with my woes\nAnd you know how that shit go\nYou know how that shit go\nYou know how that shit go\nRunnin' through the 6 with my woes\nYou know how that shit go\nYou know how that shit go\nYou know how that shit go\nRunnin' through the 6 with my woes\nYou know how that shit go\n[Outro: Popcaan & \nDrake\n]\n...Shell out, all if yuh eye nuh big\nAlways haffi look out, yuh no know if yuh head book out\nDun know, a de Unruly boss, dis man\nNo bomboclat, otha\nAnd if a boy nuh like OVO or Chromatic\nYuh can jus suck yuh mada!!\nWith no apology,\n if you nuh like we, we nuh like you neither youth\nYour girl a say we cute, if you diss you will get execute\nThat's the truth, OVO Unruly\n(Machine gun shots)\nWith my woes"
  },
  {
    "artist": "Drake",
    "song_url": "https://genius.com/Drake-back-to-back-lyrics",
    "lyrics": "450 Contributors\nTranslations\nРусский (Russian)\nBack To Back Lyrics\n“Back to Back” is the second of Drake’s responses to Meek Mill following his allegations of ghostwriting in July 2015, via a now-deleted tweet:\n\n\n\nThe title refers to the second diss track in a week (it came… \nRead More\n \n[Intro]\nOh man\nOh man, oh man\nNot again\n[Verse 1]\nYeah\nI learned the game from William Wesley, you can never check me\nBack to back for the niggas that didn't get the message\nBack to back, like I'm on the cover of Lethal Weapon\nBack to back, like I'm Jordan '96, '97\nWoah—very important and very pretentious\nWhen I look back, I might be mad that I gave this attention\nYeah, but it's weighin' heavy on my conscience\nYeah, and fuck, you left The Boy no options\nI wanna see my niggas go insane\nYou gon' make me step out of my fuckin' frame\nYou gon' make me buy bottles for Charlamagne\nYou gon' make me go out of my fuckin' way\nI waited four days, nigga, where y'all at?\nI drove here in the Wraith, playin' AR-AB\nI'm not sure what it was that really made y'all mad\nBut I guess this is what I gotta do to make y'all rap\nI mean woah, can't fool the city, man, they know what's up\nSecond floor at Tootsies, gettin' shoulder rubs\nThis for y'all that think that I don't write enough\nThey just mad 'cause I got the Midas touch\nYou love her, then you gotta give the world to her\nIs that a world tour or your girl's tour?\nI know that you gotta be a thug for her\nThis ain't what she meant when she told you to open up more\nYeah, trigger fingers turn to Twitter fingers\nYeah, you gettin' bodied by a singin' nigga\nI'm not the type of nigga that'll type to niggas\nAnd shout to all my boss bitches wifin' niggas\nMake sure you hit him with the prenup\nThen tell that man to ease up\nI did another one, I did another one\nYou still ain't did shit about the other one\n[Chorus]\nI got the drink in me, going back to back\nYeah, going back to back\nI got the drink in me, going back to back\nYeah, I'm going back to back\n[Verse 2]\nI don't wanna hear about this ever again\nNot even when she tell him that they better as friends\nNot even when you saying, \"Drizzy, tell 'em again!\"\nI been puttin' on a show, it was a sell-out event\nOh, you need better seatin'\nI didn't wanna do it, gave me every reason\nThe point I'm tryin' to make is I don't ever need 'em\nSeen what you'd do for fame, what would you do for freedom?\nPlease, check 'em for a wire or a earpiece\nPlease, please do not let these niggas near me\nPlease, think before you come for the great one\nPlease, who's a real nigga and who ain't one?\nPlease, somebody stop me\nI'm talkin' boasy and gwanin wassy\nI got the fest in five days and it's my shit\nSoon as a nigga hit the stage, they gon'\n[Chorus]\nThey gon' ask if I can play this shit back to back\nYeah, they want it back to back\nThey gon' ask if I can play this shit back to back\nI took a break from \nViews\n, now it's back to that, nigga (Six)"
  }
]