[
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-sicko-mode-lyrics",
    "lyrics": "931 Contributors\nTranslations\nEspañol\nPortuguês\nРусский (Russian)\nTürkçe\nFrançais\nDeutsch\nItaliano\nSICKO MODE Lyrics\n“SICKO MODE” refers to Travis and Drake’s work ethic, showing they’re a cut above the competition by going into “sicko” or “beast” mode.\n\n“Sicko,” or “6icko” (the 6 referring to Drake’s hometown Toronto), is… \nRead More\n \n[Part I]\n[Intro: Drake]\nAstro, yeah\n[Verse: Drake]\nSun is down, freezin' cold\nThat's how we already know, winter's here\nMy dawg would probably do it for a Louis belt\nThat's just all he know, he don't know nothin' else\nI tried to show 'em, yeah\nI tried to show 'em, yeah, yeah\nYeah, yeah, yeah\nGoin' on you with the pick and roll\nYoung La Flame, he in sicko mode\n[Part II]\n[Verse 1: Travis Scott & \nThe Notorious B.I.G\n.\n]\n(Woo) Made this here with all the ice on in the booth\nAt the gate outside, when they pull up, they get me loose\nYeah, Jump Out boys, that's Nike boys, hoppin' out coupes\nThis shit way too big, when we pull up, give me the loot (\nGimme the loot!\n)\nWas off the Remy, had a Papoose\nHad to hit my old town to duck the news\nTwo-four hour lockdown, we made no moves\nNow it's 4 a.m. and I'm back up poppin' with the crew\nI just landed in, Chase B mixes pop like Jamba Juice\nDifferent colored chains, think my jeweler really sellin' fruits\nAnd they chokin', man, know the crackers wish it was a noose\n[Refrain: Big Hawk & \nSwae Lee\n]\nSome-some-some-someone said\nTo win the retreat, we all in too deep\nPlay-play-playin' for keeps, don't play us for weak (\nSomeone said\n)\nTo win the retreat, we all in too deep\nPlay-play-playin' for keeps, don't play us for weak\n[Verse 2: Travis Scott & \nUncle Luke\n]\nYeah, this shit way too formal, y'all know I don't follow suit\nStacey Dash, most of these girls ain't got a clue\nAll of these hoes I made off records I produced\nI might take all my exes and put 'em all in a group\nHit my eses, I need the bootch\n'Bout to turn this function to Bonnaroo\nTold her, \"Hop in, you comin' too\"\nIn the 305, bitches treat me like I'm Uncle Luke\n(\nDon't stop, pop that pussy!\n)\nHad to slop the top off, it's just a roof, uh\nShe said, \"Where we goin'?\" I said, \"The moon\"\nWe ain't even make it to the room\nShe thought it was the ocean, it's just the pool\nNow I got her open, it's just the Goose\nWho put this shit together? I'm the glue\n[Refrain: Travis Scott, \nSwae Lee\n & \nBig Hawk\n]\nSomeone said\nShorty FaceTimed me out the blue\nSomeone said\nPlay-playin' for keeps\nSomeone said, mother****, someone said\nDon't play us for weak\n[Part III]\n[Intro: Travis Scott, \nDrake\n & \nLil Juice\n]\nYeah\nAstro, yeah, yeah\n(\nTay Keith, fuck these niggas up\n)\nAyy, ayy\n[Chorus: Drake & \nTravis Scott\n]\nShe's in love with who I am\nBack in high school, I used to bus it to the dance (\nYeah\n)\nNow I hit the FBO with duffels in my hands\nI did half a Xan, thirteen hours 'til I land\nHad me out like a light, ayy, yeah\nLike a light, ayy, yeah\n[Verse 1: Drake & \nTravis Scott\n]\nLike a light, ayy, slept through the flight, ayy\nKnocked for the night, ayy\n767, man, this shit got double bedroom, man\nI still got scores to settle, man\nI crept down the block (Down the block)\nMade a right (Yeah, right)\nCut the lights (Yeah, what?), paid the price (Yeah)\nNiggas think it's sweet (Nah, never), it's on sight (Yeah, what?)\nNothin' nice (Yeah), baguettes in my ice (Aw, man)\nJesus Christ (Yeah), checks over stripes (Yeah)\nThat's what I like (\nYeah\n), that's what we like (\nYeah\n)\nLost my respect, you not a threat\nWhen I shoot my shot, that shit wetty like I'm Sheck (\nBitch\n)\nSee the shots that I took (Ayy), wet like I'm Book (Ayy)\nWet like I'm Lizzie\nI be spinnin' Valley, circle blocks 'til I'm dizzy (Yeah, what?)\nLike where is he? (Yeah, what?)\nNo one seen him (Yeah, yeah)\nI'm tryna clean 'em (Yeah)\n[Chorus: Drake & \nTravis Scott\n]\nShe's in love with who I am\nBack in high school, I used to bus it to the dance\nNow I hit the FBO with duffels in my hands (\nWoo\n)\nI did half a Xan, thirteen hours 'til I land\nHad me out like a light (\nLike a light\n)\nLike a light (\nLike a light\n)\nLike a light (\nLike a light\n)\nLike a light\n[Verse 2: Travis Scott]\nYeah, passed the dawgs a celly\nSendin' texts, ain't sendin' kites, yeah\nHe said, \"Keep that on lock\"\nI say, \"You know this shit, it's stife,\" yeah\nIt's absolute, yeah (Yeah), I'm back, reboot (It's lit)\nLaFerrari to Jamba Juice, yeah (Skrrt, skrrt)\nWe back on the road, they jumpin' off, no parachute, yeah\nShorty in the back\nShe said she workin' on her glutes, yeah (Oh my God)\nAin't by the book, yeah, this how it look, yeah\n'Bout a check, yeah (Check), just check the foots, yeah\nPass this to my daughter, I'ma show her what it took (Yeah)\nBaby mama cover \nForbes\n, got these other bitches shook\nYeah"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-goosebumps-lyrics",
    "lyrics": "508 Contributors\nTranslations\nEspañol\nItaliano\nPortuguês\nРусский (Russian)\nTürkçe\ngoosebumps Lyrics\n“goosebumps” is an eerie love song. Travis and Kendrick detail the unique feelings they have for their love interests—especially when she’s not actually there.\n\nBefore performing this song live, Travis says… \nRead More\n \n[Intro: Travis Scott]\nYeah\n7:30 in the night, yeah\nOoh, ooh\n[Chorus: Travis Scott]\nI get those goosebumps every time, yeah, you come around, yeah\nYou ease my mind, you make everything feel fine\nWorried 'bout those comments\nI'm way too numb, yeah, it's way too dumb, yeah\nI get those goosebumps every time, I need the Heimlich\nThrow that to the side, yeah\nI get those goosebumps every time, yeah\nWhen you're not around (Straight up)\nWhen you throw that to the side, yeah (It's lit)\nI get those goosebumps every time, yeah\n[Verse 1: Travis Scott]\n7-1-3\nThrough the 2-8-1, yeah, I'm ridin', why they on me?\nWhy they on me? I'm flyin', sippin' low-key\nI'm sippin' low-key in Onyx, rider, rider\nWhen I'm pullin' up right beside ya\nPop star, lil' Mariah\nWhen I text a cute game, wildness\nThrow a stack on the Bible\nNever Snapchat or took molly\nShe fall through plenty, her and all her ginnies, yeah\nWe at the top floor, right there off Doheny, yeah\nOh no, I can't fuck with y'all\nYeah, when I'm with my squad, I cannot do no wrong\nYeah, saucin' in the city, don't get misinformed\nYeah, they gon' pull up on you (Brr, brr, brr)\nYeah, we gon' do some things, some things you can't relate\nYeah, 'cause we from a place, a place you cannot stay\nOh, you can't go, oh, I don't know\nOh, back the fuck up off me (Brr, brr, brr)\n[Chorus: Travis Scott]\nI get those goosebumps every time, yeah, you come around, yeah\nYou ease my mind, you make everything feel fine\nWorried 'bout those comments\nI'm way too numb, yeah, it's way too dumb, yeah\nI get those goosebumps every time, I need the Heimlich\nThrow that to the side, yeah\nI get those goosebumps every time, yeah\nWhen you're not around\nWhen you throw that to the side, yeah\nI get those goosebumps every time\n[Verse 2: Kendrick Lamar]\nUh, I want to press my like, yeah, I wanna press my\nI want a green light, I wanna be like\nI wanna press my line, yeah\nI wanna take that ride, yeah\nI'm gonna press my line\nI want a green light, I wanna be like, I wanna press my—\nMama dearest, spare your feelings\nI'm relivin' moments, peelin' more residual\nI can buy the buildin', burn the buildin'\nTake your bitch, rebuild the buildin' just to fuck some more\nI can justify my love for ya\nAnd touch the sky for God to stop debating war\nPut the pussy on a pedestal (Ayy)\nPut the pussy on a high horse\nThat pussy to die for\nThat pussy to die for\nPeter Piper picked a pepper\nSo I could pick your brain and put your heart together\nWe depart the shady parts and party hard\nThe diamonds yours, the coupe forever\nMy best shot just might shoot forever like (Brr)\n[Chorus: Travis Scott]\nI get those goosebumps every time, yeah, you come around, yeah\nYou ease my mind, you make everything feel fine\nWorried 'bout those comments\nI'm way too numb, yeah, it's way too dumb, yeah\nI get those goosebumps every time, I need the Heimlich\nThrow that to the side, yeah\nI get those goosebumps every time, yeah\nWhen you're not around\nWhen you throw that to the side, yeah\nI get those goosebumps every time"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Sza-love-galore-lyrics",
    "lyrics": "216 Contributors\nTranslations\nTürkçe\nPortuguês\nEnglish\nLove Galore Lyrics\nSZA enlists Travis Scott for “Love Galore\"—a song where she touches on cravings for a past lover, rebirth after a regretful relationship, and putting herself first after a loveless affair.\n\n“Love Galore” was… \nRead More\n \n[Part I]\n[Intro: Travis Scott]\nI need, I need\nI need, I need\nI need, I need\nI need, I need\nI need, I need\n[Chorus: SZA]\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\n[Verse 1: SZA & \nTravis Scott\n]\nDone with these niggas, I don't love these niggas\nI dust off these niggas, do it for fun\nDon't take it personal\nPersonally, I'm surprised you called me after the things I said\nSkrrt-skrrt on niggas (\nYeah\n), skrrt up on niggas (\nTrue\n)\nSkrrt down, you actin' like me (\nYeah\n)\nActin' like we wasn't more than a summer fling\nI said farewell, you took it well (\nTrue\n)\nPromise I won't cry over spilled milk (Ooh, no, I won't)\nGive me a paper towel, gimme another Valium\nGive me another hour or two, hour with you\nWhy you bother me when you know you don't want me? (\nYeah\n)\nWhy you bother me when you know you got a woman? (\nYeah\n)\nWhy you hit me when you know you know better? (\nTrue\n)\nKnow you know better (\nTrue\n)\nKnow your crew better than you do\nCall me, lookin' for ya (\nYeah\n), I be lookin' for ya (\nYeah\n)\nGot me lookin' forward to weekends\nWith you, baby, with you, baby\nWith you, baby (\nTrue\n), with you\nWe do whatever we want, go wherever we want\nLove however we want, it don't matter (\nTrue\n)\nYou do whatever I want, get whatever I want\nGet whatever I need, it's about\n[Chorus: SZA]\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\n[Verse 2: SZA & \nTravis Scott\n]\nShould have never gave you my number, I did it with you\nShould have never let you hit it, I split it with you\nI regret it, you gots a fetish\nYou gots a problem, now it's a problem, oh, no\nSkrrt-skrrt on bitches (\nYeah\n)\nI don't know these bitches (\nYeah\n)\nDig dirt on bitches, do it for fun\nDon't take it personal, baby\nLove on my ladies, l-love to my ladies, uh (\nTrue\n)\nDated a few (\nStraight up\n)\n[Verse 3: Travis Scott & \nSZA\n]\nWhy you bother me? Why you bother me? Why you bother me? (Why you bother me? Yeah)\nLast time I checked, you were the one that left (\nThe one\n)\nMe in a wreck (Yeah), me in a mess (Yeah, yeah)\nYou all I rep (Yeah), like my side I rep (Yeah)\nYeah, that's that Mo City, that side that you can't come 'round at night, yeah (It's lit)\nYou like to get me high, you don't want no one beside ya\nYou like when I make fire\n, you say, \"La Flame, keep makin' fire\" (Ooh)\nLet me cum inside ya, let me plant that seed inside ya (Ooh)\nAss and titties, titties, only thing that stuck with, with me (With me)\nOnly thing that was real, only thing I could feel, you feel me? (Yeah, feel me?)\nSo why you bother me, why you bother me? (\nWith you, baby, with you, baby\n)\nTryna catch a P.O.V., yeah (\nWith you\n)\n[Chorus: SZA]\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\n[Part II]\n[Verse: SZA]\n(Love)\nI came to your city, lookin' for lovin' and licky\n'Cause you promised to put it down\nAll up in your city, lookin' for you, uh\nSearchin' for you, like, love\nOnly thing keepin' me from droppin' you right now\nRight now (Love)\nOnly thing keepin' me by your side\nOnly thing keepin' me by your side now\n[Outro: Norma Rowe]\nBut see, Solána, if you don't say somethin', speak up for yourself\nThey think you stupid, you know what I'm sayin'?"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Kanye-west-new-slaves-lyrics",
    "lyrics": "444 Contributors\nTranslations\nTürkçe\nРусский (Russian)\nPortuguês\nEspañol\nKanye West - New Slaves (Traduzione Italiana)\nSvenska\nहिन्दी (Hindi)\nFrançais\nNew Slaves Lyrics\n“New Slaves” was the first official offering of Kanye West’s most polarizing album, Yeezus. After teasing a June 18 date through Twitter, on May 12, 2013, and performing new music privately at the Met Gala no… \nRead More\n \n[Intro: Swizz Beatz]\nChill, chill, chill, chill, chill, chill\nChill, chill, chill, chill, chill, chill\nChill, chill, chill, chill, chill, chill\nChill, chill, chill, chill, chill, chill\n[Verse 1: Kanye West]\nMy mama was raised in the era when\nClean water was only served to the fairer skin\nDoin' clothes, you would've thought I had help\nBut they wasn't satisfied unless I picked the cotton myself\nYou see, it's broke nigga racism\nThat's that, \"Don't touch anything in the store\"\nAnd it's rich nigga racism\nThat's that, \"Come in, please buy more\"\n\"What you want, a Bentley? Fur coat? A diamond chain?\nAll you blacks want all the same things\"\nUsed to only be niggas, now everybody playin'\nSpendin' everything on Alexander Wang\nNew slaves\n[Bridge: Kanye West]\nYou see it's leaders and it's followers\nBut I'd rather be a dick than a swallower\nYou see it's leaders and it's followers\nBut I'd rather be a dick than a swallower\n[Verse 2: Kanye West]\nI throw these Maybach keys,\n \nI wear my heart on the sleeve\nI know that we the new slaves, I see the blood on the leaves\nI see the blood on the leaves, I see the blood on the leaves\nI know that we the new slaves, I see the blood on the leaves\nThey throwin' hate at me, want me to stay at ease\nFuck you and your corporation, y'all niggas can't control me\nI know that we the new slaves, I know that we the new slaves\nI'm 'bout to wild the fuck out, I'm goin' Bobby Boucher\nI know that pussy ain't free,\n \nyou niggas pussy, ain't me\nY'all throwin' contracts at me, you know that niggas can't read\nThrow on some Maybach keys,\n \nfuck it, c'est la vie\nI know that we the new slaves,\n \ny'all niggas can't fuck with me\nY'all niggas can't fuck with Ye, y'all niggas can't fuck with Ye\nI'll move my family out the country, so you can't see where I stay\nSo go and grab the reporters, so I can smash their recorders\nSee, they'll confuse us with some bullshit, like the New World Order\nMeanwhile the DEA\n \nteamed up with the CCA\nThey tryna lock niggas up, they tryna make new slaves\nSee, that's that privately owned prison,\n \nget your peace today\nThey prolly all in the Hamptons\n \nbraggin' 'bout what they made\nFuck you and your Hampton house, I'll fuck your Hampton spouse\nCame on her Hampton blouse and in her Hampton mouth\nY'all 'bout to turn shit up, I'm 'bout to tear shit down\nI'm 'bout to air shit out,\n \nnow what the fuck they gon' say now?\n[Bridge]\nNothing bad, nothing bad, noth—\nNoth-noth— 'ing bad, noth— (Noth-noth—)\nBad, nothing bad, nothing bad\nNothing—\n[Outro: Kanye West, \nFrank Ocean\n & \nKóbor János\n]\nI won't end this fight, not this time again\nSo long, so long, so long,\n \nyou cannot survive\nAnd I'm not dyin', and I can't lose\nI can't lose, no, I can't lose\n'Cause I can't leave it to you\nSo let's get too high, get too high again\nToo high again, too high\nOoh, ooh, ooh, o-ooh, ooh\nWoo \n(\nHey\n)\nOoh, ooh-ooh, high, hi-high, high\nHigh, high, hi-high (Yeah)\nHigh, high, ah, oh\nEgyszer a Nap úgy elfáradt\n (\nAh, ah, ah\n)\nElaludt mély zöld tó ölén\nAz embereknek fájt a sötét\nŐ megsajnált, eljött közénk\n[Produced by Che Pope, Sham Joseph, Ben Bronfman, Noah Goldstein, Travis Scott, Mike Dean & Kanye West]"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-butterfly-effect-lyrics",
    "lyrics": "285 Contributors\nTranslations\nРусский (Russian)\nPortuguês\nEspañol\nTürkçe\nItaliano\nSvenska\nFrançais\nBUTTERFLY EFFECT Lyrics\n“BUTTERFLY EFFECT” is Travis Scott’s first solo release of 2017. It serves as the lead single to his third studio album, ASTROWORLD, which was released more than a year after this song. It is produced by… \nRead More\n \n[Intro]\n(\nAll the commas\n)\n(\nMurda on the beat, so it's not nice\n)\nOoh, hmm\n[Chorus]\nFor this life, I cannot change (Change)\nHidden Hills, deep off in the main (Main)\nM&M's, sweet like candy cane (Cane)\nDrop the top, pop it, let it bang (Pop it, pop it)\nFor this life, I cannot change\nIn the hills, deep off in the main\nM&M's, sweet like candy cane\nDrop the top, pop it, let it bang (Pop it, pop it)\n[Verse 1]\nDrop the top, play hide and seek (Yeah)\nJump inside, jump straight to the league (League)\nTake a sip, feel just how I be (It's lit)\nOn Freeway, but no, ain't nothin' free (Straight up)\nBend laws, bend lanes (Skrrt, skrrt)\nBeen bustin' bills, but still, ain't nothin' change (Skrrt, skrrt, skrrt, skrrt)\nYou in the mob soon as you rock the chain (Skrrt, skrrt, mob)\nShe caught the waves, just thumbin' through my braids (Alright)\nHeatin' up, baby, I'm just heatin' up (It's lit)\nNeed your love, not a need, it is a must (Yeah)\nFeelin' stuck, you know how to keep me up (Yeah, yeah)\nIcy love, icy like a hockey puck (Alright)\n[Chorus]\nFor this life, I cannot change (Change)\nHidden Hills, deep off in the main (Main)\nM&M's, sweet like candy cane (Cane)\nDrop the top, pop it, let it bang (Pop it, pop it)\nFor this life, I cannot change\nHidden Hills, deep off in the main (Yeah, yeah)\nM&M's, sweet like candy cane\nDrop the top, pop it, let it bang\n[Verse 2]\nAll the ones, all the chains piled on the mantle (Yeah)\nAll the dawgs, all the dawgs low creep right behind me in the Phantom (It's lit)\nYeah, never go, never go dip on the set, stayed Santana\nYeah, run it back, turn the lights on when I hit up Green Lantern (It's lit, alright)\nYeah, fly the broads, fly the dawgs down to Atlanta\nYeah, in the cut in Medusa, lay low, yeah, I might be\nYeah, roll up, help me calm down when I'm movin' high speed\nYeah, if I send one, need to text back 'cause you know what I need (Straight up)\nOh, please, oh, me, oh, my\nWe been movin', we been movin' for some time (Alright)\nFlexin', flexin', try to exercise\nExercise (Exercise), exercise (Exercise), exercise (Exercise), exercise (Exercise)\n(Yeah, yeah)\n[Chorus]\n(For this life)\nFor this life, I cannot change (Change)\nHidden Hills, deep off in the main (Main)\nM&M's, sweet like candy cane (Cane)\nDrop the top, pop it, let it bang (Pop it, pop it)\nFor this life, I cannot change\nHidden Hills, deep off in the main\nM&M's, sweet like candy cane\nDrop the top, pop it, let it bang (Bang, yeah)"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-highest-in-the-room-lyrics",
    "lyrics": "253 Contributors\nTranslations\nTürkçe\nEspañol\nРусский (Russian)\nPortuguês\nPolski\nItaliano\nDeutsch\nFrançais\nفارسی\nDansk\nShqip\nHIGHEST IN THE ROOM Lyrics\nOn “HIGHEST IN THE ROOM,” Travis discusses his relationship with his then-wife and mother of his child – Kylie Jenner – and his self-proclaimed title as the most intoxicated person in the place he is in.\n… \nRead More\n \n[Chorus]\nI got room in my fumes (Yeah)\nShe fill my mind up with ideas\nI'm the highest in the room (It’s lit)\nHope I make it outta here (Let's go)\n[Verse 1]\nShe saw my eyes, she know I'm gone (Ah)\nI see some things that you might fear\nI’m doin' a show, I'll be back soon (Soon)\nThat ain't what she wanna hear (Nah)\nNow I got her in my room (Ah)\nLegs wrapped around my beard\nGot the fastest car, it zoom (Skrrt)\nHope we make it outta here (Ah)\nWhen I'm with you, I feel alive\nYou say you love me, don't you lie (Yeah)\nWon't cross my heart, don't wanna die\nKeep the pistol on my side (Yeah)\n[Chorus]\nCase it’s fumes (Smoke)\nShe fill my mind up with ideas (Straight up)\nI’m the highest in the room (It's lit)\nHope I make it outta here (Let’s go, yeah)\n[Verse 2]\nWe ain't stressin' 'bout the loot (Yeah)\nMy block made of quesería\nThis not the molly, this the boot\nAin’t no comin' back from here\nLive the life of La Familia\nIt's so much gang that I can't see ya (Yeah)\nTurn it up 'til they can't hear (We can't)\nRunnin', runnin' 'round for the thrill\nYeah, dawg, dawg, 'round my real (Gang)\nRaw, raw, I been pourin' to the real (Drank)\nNah, nah, nah, they not back of the VIP (In the VIP)\nGorgeous, baby, keep me hard as steel\nAh, this my life, I did not choose\nUh, been on this since we was kids\nWe gon' stay on top and break the rules\nUh, I fill my mind up with ideas\n[Chorus]\nCase it's fumes\nShe fill my mind up with ideas (Straight up)\nI'm the highest in the room (I'm the highest, it's lit)\nHope I make it outta here\n[Outro]"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-antidote-lyrics",
    "lyrics": "231 Contributors\nTranslations\nEspañol\nРусский (Russian)\nPortuguês\nУкраїнська\nSvenska\nAntidote Lyrics\nProduced by Eestbound, WondaGurl, and Travis himself, “Antidote” was not initially intended to appear on Rodeo, as confirmed on Travis' SoundCloud on June 23rd:\n\nThis is for the real fans; the real ragers!… \nRead More\n \n[Chorus]\nDon't you open up that window\nDon't you let out that antidote (Yeah)\nPoppin' pills is all we know (Ooh)\nIn the hills is all we know (Hollywood)\nDon't go through the front door (Through the back)\nIt's lowkey at the night show (Ooh)\nSo, don't you open up that window (Ooh)\nDon't you let out that antidote, yeah\n[Verse 1]\nParty on a Sunday (That was fun)\nDo it all again on Monday (One more time)\nSpent a check on a weekend (Oh my God)\nI might do it all again (That's boss shit)\nI just hit a three peat (Ooh)\nFucked three hoes I met this week (Robert Horry)\nI don't do no old hoes (Oh, no, no)\nMy nigga, that's a no-no (Straight up)\nShe just want the coco (Cocaína)\nI just want dinero (Paper hunt, wait)\nWho that at the front door? (Who that is?)\nIf it's the feds, oh, no, no, no (Don't let 'em in, shh)\n[Chorus]\nDon't you open up that window (Yeah, yeah, yeah, yeah)\nDon't you let out that antidote (Yeah, yeah, yeah, ooh, yeah)\nPoppin' pills is all we know (Yeah)\nIn the hills is all we know (Hollywood)\nDon't go through the front door (In the back)\nIt's lowkey at the night show (Ooh)\n[Verse 2]\nYeah, ooh, ooh, at the night show (Ooh-ooh-ooh, ah)\nAt the night show (Higher)\nAt the night show (Ooh-ooh-ooh, ah)\nOoh, at the night show (Get lit, my nigga)\nOoh, at the night show (Yeah)\nAnything can happen at the night show (Ooh-ooh-ooh, ah)\nEverything can happen at the night show\nOoh, at the night show\nAnything can happen at the night show\nOoh, at the night show\nOoh, your bitch not at home, she at the night show\nOoh (Straight up), fuckin' right, ho\nOoh, had to catch a flight for the night show\nOoh (Let's go), let's get piped though\nBottles got us right though, we ain't sippin' light, no (Rrr, La Flame)\nI ain't got no type though\nOnly got one night though\nWe can do it twice though (Rrr, it's lit)\n[Bridge]\nAt the night show, ooh\nAt the night show (Ooh, ooh)\nAt the night show\nOoh, at the night show\nYeah, at the night show\nEverything can happen at the night show\nOoh, at the night show\nAnything can happen at the night show, ooh\n[Verse 3]\nStackin' up day to day, young nigga\nYou know you gotta go get it, go get it, my nigga\nThey hatin', they stankin', they waitin'\nDon't be mistaken, we dyin', they stayin'\nLord, I'm on fire, they think that I'm Satan\nCallin' me crazy on different occasions\nKickin' the cameraman off of my stages\n'Cause I don't like how he snappin' my angles\nI'm overboard and I'm over-impatient\nOver my niggas and these kids my ages\nDealin' with Mo' shit that's more complicated\nLike these two bitches that might be related\nH-Town, you got one, and you Bun B like a number-one\nIt's late night, got a late show\nIf you wanna roll, I got a place where, ah\n[Chorus]\nPoppin' pills is all we know (Ooh)\nIn the hills is all we know (Hollywood)\nDon't go through the front door (Through the back)\nIt's lowkey at the night show (Ooh)\n[Outro]\nSo don't you open up that window (Ooh)\n(Don't you let out that antidote)"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-stargazing-lyrics",
    "lyrics": "345 Contributors\nTranslations\nEspañol\nРусский (Russian)\nPortuguês\nFrançais\nDeutsch\nItaliano\nSTARGAZING Lyrics\n“STARGAZING” is a song describing the experience of an unpredictable psychedelic trip. Travis Scott’s delivery switches between his regular cadence and an auto-tuned falsetto.\n\nThe song was first previewed on… \nRead More\n \n[Part I]\n[Intro]\nAh\n[Chorus]\nRollin', rollin', rollin', got me stargazin' (Yeah)\nSippin' on purp, feelin' like the Barre Baby (It's lit)\nWhatever I downed, it got me goin' crazy (Yeah)\nPsychedelics got me goin' crazy (Alright)\n[Post-Chorus]\nI was hot as hell out in the heat (Yeah, yeah)\nThen a storm came in and saved my life\nHead up to the sky, down on my knees (Straight up)\nOut of nowhere, you came here to save the night\nIn the nighttime (Woo, yeah)\n[Verse]\nRollin', rollin', rollin', got me stargazin' (Roll)\nPsychedelics got me goin' crazy (Oh, no)\nNiggas femalin', they excellin' (Yeah)\nAre they intellin'? (What you tellin'?)\nWe propellin', up top with Ellen, uh (With the choppers)\nKill the jealous with propane repellent\nGot me goin' crazy (It's lit)\nOn tour, we'll tell 'em, we brought the section (Gang)\nThey keep on callin' up, it's getting hectic (Brrt)\nLike we projected\nSo we cut the plug, he's interjected (Got me goin' crazy)\n[Chorus]\nRollin', rollin', rollin', got me stargazin' (Yeah)\nSippin' on purp, feelin' like the Barre Baby (It's lit)\nWhatever I downed, it got me goin' crazy (Yah)\nPsychedelics got me goin' crazy (Alright)\n[Post-Chorus]\nI was hot as hell out in the heat (Yeah, yeah)\nThen the storm came in and saved my life\nHead up to the sky, down on my knees (Straight up)\nOut of nowhere, you came here to save the night\nIn the nighttime (Woo, yeah)\n[Segue]\nGot me goin' crazy\n[Part II]\n[Verse: Travis Scott & \nMC E\n]\nOkay, I been up for some days, I ain't got time to lay\nJust to drown out all these thoughts, I tried all kind of things\nIf I take you to my past, you will be traumatized\nGot a thousand kids outside that's tryna come alive\n'99, took AstroWorld, it had to relocate\nTold the dawgs I'd bring it back, it was a seal of faith\nBefore no car notes, baby girl, she played the tourist guide\nGot the keys into my city, now she know the rides\nGot new money, got new problems, got new enemies\nWhen you make it to the top, that's the amenities\nPackin' out Toyota like I'm in the league\nAnd it ain't a mosh pit if ain't no injuries\nI got 'em stage divin' out the nosebleeds\n \n(\nAlright, alright, alright\n)\nAnd she hit that booger sugar 'til her nose bleed\n \n(\nAlright, alright, alright\n)\nBounce that shit forever, she on both knees\nShe was talkin' 'bout forever, got a whole week\n \n(\nAlright, alright, alright\n)\nPlus, she know my baby mama is a trophy\nShe be throwin' up them B's, feel like we both bleed\nShe keep my dick jumpin' up, feel like I'm Moby\nI'm way too gold for this beef, feel like I'm Kobe, yeah\nThis right here is astronomical\nI see you picked up all my ways, I feel responsible\nThey tryna say that all my problems is improbable\nThey keep itchin' at my spirit, I'm diabolical, you feel me?"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-90210-lyrics",
    "lyrics": "399 Contributors\nTranslations\nEspañol\nTravis Scott - 90210 ft. Kacy Hill (Azərbaycan Tərcümə)\nTürkçe\nFrançais\nPortuguês\n90210 Lyrics\n“90210” is the 5th track from Travis Scott’s debut album Rodeo and his self-professed favorite song on the album.\n\n“90210” is the postal code for Beverly Hills. On the track, Travis waxes lyrical about the… \nRead More\n \n[Part I]\n[Intro: Travis Scott, \nChantel Jeffries\n & \nKacy Hill\n]\n(\nDean, what's poppin'? Hahahahaha. Yo, Travis\n)\nMhm, ooh-ooh-ooh-ooh-ooh-ooh-ooh-ooh-ooh\nMama's mailin' out that blow, cravin' 9021—\nOoh-ooh-ooh-ooh-ooh\n[Verse 1: Travis Scott & \nChantel Jeffries\n]\nShe a porn star girl, ah, from the valley\n(\nHonestly, God bless\n)\nWho left her hometown world all for that alley\nOoh, created Lake Tahoe all from her panties\n(\nI hope it was wet like my jumper, though\n)\nOoh, used to take the long way home\nLong way home, all for that candy\n (\nHahahahaha\n,\n mhm)\n[Chorus: Kacy Hill]\nBaby's hooked on feeling low-ow\nDo, do, do\nDo, do\n[Verse 2: Travis Scott]\nJacques turned La Flame, now he rollin' on an Addy\nFifty on a chain, 'nother fifty on a Caddy\nOoh, he might pop him a pill, pop him a seal\nPop anyone, pop anything\nPop anything to find that alley\nMhm, yeah, to find that alley (Mhm)\n[Chorus: Kacy Hill]\nBaby's hooked on feeling low-ow\nDo, do, do\nDo, do\n[Segue: Travis Scott, \nKacy Hill\n & \nChantel Jeffries\n]\nIn the 90210, 90210, lookin' for that alley\nIn the 90210, 90210, lookin' for that alley, ooh\nIt's the superstar girl, superstar girl, roamin' in that alley\n(\nBaby's hooked on feeling low-ow\n)\nOoh, in the 90210, 90210, somewhere in that alley\n(\nDo, do, do\n)\n(\nDo, do\n)\nOoh, ahh\n(\nI gotta tell ya\n)\n[Part II]\n[Intro: Travis Scott]\n(Ooh-ooh-ooh-ooh)\n(Ooh-ooh-ooh-ooh)\n(Ooh-ooh-ooh-ooh)\nOoh-ooh\n(\nBall, ball, ball in, in\n)\n(\nBall, ball, ball in, in\n)\nOoh-ooh-ooh-ooh-ooh\n(\nBall, ball, ball in, in\n)\n(\nBall, ball, ball in, in\n)\nYeah\n[Verse: Travis Scott]\nMy granny called, she said, \"Travvy, you work too hard\nI'm worried you forget about me\"\n(\nBall, ball, ball\n)\nI'm fallin' in and out of clouds\nDon't worry, I'ma get it, Granny, uh\nWhat happened? Now my daddy happy\nMama called me up, that money comin' and she love me\n(\nBall, ball, ball in, in\n)\nI done made it now, I done found life's meanin' now\n(\nBall, ball, ball in, in\n)\nAll them days her heart'd break, her heart not in pieces now\nFriends turnin' into fraud niggas\nPracticin' half the passion, you niggas packaged different\n(\nBall, ball, ball in, in\n)\nAll you niggas, you niggas want the swag, you can't have it\n(\nBall, ball, ball in, in\n)\nI'ma sell it, your niggas salary, we 'bout to cap, bitch\nYoungest nigga out of Houston at the Grammys\nSmilin' at 'em laughin' at me\nI passed the rock to Ye, he pump faked, then passed it back, bitch\n(\nBall, ball, ball in, in\n)\nAll of this off of rappin', should've wrote this in Latin, yeah-yeah\n(\nBall, ball, ball in, in\n)\nMmm, I know, I know, I know, I know, I know\nI know, I know, I know, I know, I know\nCuzzo said we hit the store, yeah, we 'bout to drop a four\nHe passed the cigarette, I choke, woo\nTold my auntie, \"Put them 'Ports down, them 'Ports down\"\nNow you know you love your own now\nHit the stage, they got their hands up, don't put your nose down\nI ain't knockin', nigga, I knocked the door down, for sure now\nWhole crew, I swear they countin' on me\nGold chains, gold rings, I got an island on me\nHouses on me, he got them ounces on him\nHoly Father, come save these niggas, I'm stylin' on 'em\nGood Lord, I see my good fortune in all these horses\nI'm drivin' too fast to stop, so all these signs, I ignore them\nJust this guy from north of the border, my chips is in order\nMy mom's biggest supporter, so now a nigga support a nigga\n[Outro: Travis Scott]\n(Ooh-ooh-ooh-ooh-ooh-ooh-ooh)\n(Ooh-ooh-ooh-ooh-ooh-ooh-ooh)"
  },
  {
    "artist": "Travis-scott",
    "song_url": "https://genius.com/Travis-scott-fe-n-lyrics",
    "lyrics": "408 Contributors\nTranslations\nPortuguês\nEspañol\nРусский (Russian)\nTürkçe\n한국어 (Korean)\nDeutsch\nУкраїнська\nFrançais\nRomână\nDansk\nTürkçe\nFE!N Lyrics\n“FE!N” reunites Atlanta rapper Playboi Carti with Travis Scott, following their 2018 single “Love Hurts” from Carti’s debut studio album, Die Lit.\n\nThe allegiance of the two introduces a different soundscape… \nRead More\n \n[Intro: Travis Scott & \nSheck Wes\n]\nJust come outside for the night (\nYeah\n)\nTake your time, get your light (\nYeah\n)\nJohnny Dang, yeah, yeah\nI been out geekin' (\nBitch\n)\n[Chorus: Travis Scott]\nFE!N, FE!N, FE!N, FE!N, FE!N (Yeah)\nFE!N, FE!N, FE!N, FE!N, FE!N (Yeah)\nFE!N, FE!N, FE!N, FE!N, FE!N\nFE!N, FE!N (Yeah), FE!N, FE!N, FE!N\n[Verse 1: Travis Scott & \nSheck Wes\n]\nThe career's more at stake when you in your prime (At stake)\nFuck that paper, baby, my face on the dotted line (Dot, \nyeah\n)\nI been flyin' out of town for some peace of mind (\nYeah, yeah, bitch\n)\nIt's like always they just want a piece of mine (Ah)\nI been focused on the future, never on right now (Ah)\nWhat I'm sippin' not kombucha, either pink or brown (It's lit)\nI'm the one that introduced you to the you right now (Mm, let's go)\nOh my God, that bitch bitin' (That bitch bitin')\nWell, alright (Alright), tryna vibe (I'm tryna vibe this)\nIn the night, come alive\nAin't asleep, ain't a—, ain't a—, ain't-ain't\n[Chorus: Travis Scott]\nFE!N, FE!N, FE!N, FE!N, FE!N\nFE!N, FE!N, FE!N, FE!N, FE!N\nFE!N, FE!N, FE!N, FE!N, FE!N\nFE!N, FE!N, FE!N, FE!N\nFE!N, FE!N, FE!N, FE!N, FE!N\n[Bridge: Playboi Carti]\nSchyeah, woah, what?\nWhat?\n(Homixide, Homixide, Homixide, Homixide)\nWhat? (Yeah)\nWoah, woah (Yeah, yeah)\n(Homixide, Homixide, Homixide, Homixide)\nHit, yeah, hold up (Yeah)\n[Verse 2: Playboi Carti]\nYeah, I just been poppin' my shit and gettin' it live, hold up (Shit)\nYeah, you try to come wrong 'bout this shit, we poppin' your tires, hold up (Shit)\nUh, hundred-round (Woah), feelin' like I'm on ten\nPlayin' both sides with these hoes (Hold up), shawty, I'm fuckin' your friend (Hold up)\nI've been goin' crazy, shawty, I've been in the deep end\nShe not innocent, uh, she just tryna go\n[Chorus: Travis Scott & \nPlayboi Carti\n]\nFE!N (\nTalkin' 'bout\n), FE!N, FE!N (Schyeah), FE!N, FE!N (\nSchyeah, oh, oh, what? Schyeah\n)\nFE!N, FE!N (\nSchyeah\n), FE!N, FE!N, FE!N (\nOh, oh\n)\nFE!N, FE!N (\nTalkin' 'bout\n), FE!N, FE!N, FE!N, FE!N (\nTalkin' 'bout\n, let's go)\n[Verse 3: Playboi Carti & \nTravis Scott\n]\nI just been icin' my hoes, I just been drippin' my hoes (Drippin' my hoes)\nThis is a whole 'nother level, shawty (Oh), I got these hoes on they toes (Hoes on they toes)\nI put the bitch on the road, she tryna fuck on the O, hold up, hold up\nI got this ho with me, she tryna show me somethin', hold up, hold up (Oh)\nI got flows for days, these niggas ain't on nothin', hold up, yeah (Oh)\nMe and my boy locked in, you know we on one, hold up, uh\n \n(Slatt, slatt)\nWe in the spot goin' crazy until the sun up\nYou worried about that ho, that ho done chose up (Slatt, bitch-ass)\nUh, pistols all in the kitchen, can't give the zip code up, hold up, yeah, slatt (Wow)\nFE!N, FE!N, FE!N\n (Huh? Huh? Huh? Huh? \nYeah\n)\nWhy the fuck these niggas actin' like they know us?\n00CACTUS, yeah, we towed up (\nSkrrt, skrrt\n), uh, yeah\nSwitch out the bag, these niggas get rolled up, hold up (\nIt's lit\n), slatt\nEverything hit, hold up, everything Homixide, Homixide (Homixide, Homixide, Homixide, Homixide)\n[Outro: Travis Scott & \nPlayboi Carti\n]\nFE!N, FE!N, FE!N, FE!N, FE!N, FE!N\n \n(\nHomixide, Homixide, Homixide, Homixide, Homixide, Homixide, Homixide\n)"
  }
]