[
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-drivers-license-lyrics",
    "lyrics": "412 Contributors\nTranslations\nTürkçe\nEspañol\nРусский (Russian)\nPortuguês\nPortuguês\nNorsk\n日本語 (Japanese)\nItaliano\nDeutsch\nFrançais\nفارسی\nDansk\nहिन्दी (Hindi)\nPolski\nNederlands\nالعربية\n繁體中文 (Traditional Chinese)\nУкраїнська\nČesky\nБългарски\ndrivers license Lyrics\n“drivers license” is Olivia Rodrigo’s debut single. It is a rumored love ode about moving on from her past relationship with Joshua Bassett, who supposedly started dating Sabrina Carpenter, by doing the one… \nRead More\n \n[Verse 1]\nI got my driver's license last week\nJust like we always talked about\n'Cause you were so excited for me\nTo finally drive up to your house\nBut today, I drove through the suburbs\nCrying 'cause you weren't around\n[Verse 2]\nAnd you're probably with that blonde girl\nWho always made me doubt\nShe's so much older than me\nShe's everything I'm insecure about\nYeah, today, I drove through the suburbs\n'Cause how could I ever love someone else?\n[Chorus]\nAnd I know we weren't perfect, but I've never felt this way for no one\nAnd I just can't imagine how you could be so okay now that I'm gone\nGuess you didn't mean what you wrote in that song about me\n'Cause you said forever, now I drive alone past your street\n[Verse 3]\nAnd all my friends are tired\nOf hearing how much I miss you, but\nI kinda feel sorry for them\n'Cause they'll never know you the way that I do\nYeah, today, I drove through the suburbs\nAnd pictured I was driving home to you\n[Chorus]\nAnd I know we weren't perfect, but I've never felt this way for no one, oh\nAnd I just can't imagine how you could be so okay now that I'm gone\nI guess you didn't mean what you wrote in that song about me\n'Cause you said forever, now I drive alone past your street\n[Bridge]\nRed lights, stop signs\nI still see your face in the white cars, front yards\nCan't drive past the places we used to go to\n'Cause I still fuckin' love you, babe (Ooh, ooh-ooh, ooh, ooh-ooh)\nSidewalks we crossed\nI still hear your voice in the traffic, we're laughing\nOver all the noise\nGod, I'm so blue, know we're through\nBut I still fuckin' love you, babe (Ooh, ooh-ooh, ooh, ooh-ooh)\n[Chorus]\nI know we weren't perfect, but I've never felt this way for no one\nAnd I just can't imagine how you could be so okay now that I'm gone\nGuess you didn't mean what you wrote in that song about me\n'Cause you said forever, now I drive alone past your street\n[Outro]\nYeah, you said forever, now I drive alone past your street"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-deja-vu-lyrics",
    "lyrics": "248 Contributors\nTranslations\nTürkçe\nSvenska\nEspañol\nPortuguês\nPortuguês\nNorsk\nItaliano\nDeutsch\nFrançais\n日本語 (Japanese)\nPolski\nNederlands\nČesky\nРусский (Russian)\nCatalà\nDansk\nالعربية\ndeja vu Lyrics\n“deja vu” is the second single from Olivia Rodrigo’s debut studio album, SOUR, and her first release since the breakout success of her debut single, “drivers license.” This song finds Olivia at a different… \nRead More\n \n[Verse 1]\nCar rides to Malibu\nStrawberry ice cream, one spoon for two\nAnd tradin' jackets\nLaughin’ 'bout how small it looks on you\n(Ha-ha-ha-ha, ha-ha-ha-ha-ha, ha-ha-ha-ha)\nWatching reruns of \nGlee\nBein' annoying, singin’ in harmony\nI bet she's braggin' to all her friends, sayin' you're so unique, hmm\n[Chorus]\nSo when you gonna tell her that we did that, too?\nShe thinks it's special, but it's all reused\nThat was our place, I found it first\nI made the jokes you tell to her when she's with you\nDo you get déjà vu when she’s with you?\nDo you get déjà vu? (Ah) Hmm\nDo you get déjà vu, huh?\n[Verse 2]\nDo you call her, almost say my name?\n’Cause let's be honest, we kinda do sound the same\nAnother actress\nI hate to think that I was just your type\nAnd I bet that she knows Billy Joel\n’Cause you played her \"Uptown Girl\"\nYou're singin' it together\nNow I bet you even tell her how you love her\nIn between the chorus and the verse (Ooh; I love you)\n[Chorus]\nSo when you gonna tell her that we did that, too?\nShe thinks it's special, but it’s all reused\nThat was the show we talked about\nPlayed you the songs she's singing now when she's with you\nDo you get déjà vu when she's with you?\nDo you get déjà vu? (Oh-oh)\nDo you get déjà vu?\n[Bridge]\nStrawberry ice cream in Malibu\nDon't act like we didn't do that shit, too\nYou're tradin' jackets like we used to do\n(Yeah, everything is all reused)\nPlay her piano, but she doesn't know (Oh, oh)\nThat I was the one who taught you Billy Joel (Oh)\nA different girl now, but there's nothing new\n[Outro]\nI know you get déjà vu\nI know you get déjà vu\nI know you get déjà vu"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-good-4-u-lyrics",
    "lyrics": "286 Contributors\nTranslations\nEspañol\nTürkçe\nSvenska\nPortuguês\nPortuguês\n日本語 (Japanese)\nItaliano\nMagyar\nDeutsch\nFrançais\n繁體中文 (Traditional Chinese)\nالعربية\nNorsk\nРусский (Russian)\nPolski\nNederlands\nČesky\nCatalà\nעברית (Hebrew)\ngood 4 u Lyrics\n“good 4 u” is the third single from Olivia Rodrigo’s debut studio album, SOUR. The song’s hook is laced with sarcasm, as Olivia sharply addresses her former partner for quickly moving on from their… \nRead More\n \n[Intro]\n(Ah)\n[Verse 1]\nWell, good for you, I guess you moved on really easily\nYou found a new girl and it only took a couple weeks\nRemember when you said that you wanted to give me the world?\n(World)\nAnd good for you, I guess that you've been workin' on yourself\nI guess that therapist I found for you, she really helped\nNow you can be a better man for your brand-new girl (Girl)\n[Chorus]\nWell, good for you\nYou look happy and healthy, not me\nIf you ever cared to ask\nGood for you\nYou're doin' great out there without me, baby\nGod, I wish that I could do that\nI've lost my mind, I've spent the night\nCryin' on the floor of my bathroom\nBut you're so unaffected, I really don't get it\nBut I guess good for you\n[Verse 2]\nWell, good for you, I guess you're gettin' everything you want (Ah)\nYou bought a new car and your career's really takin' off (Ah)\nIt's like we never even happened\nBaby, what the fuck is up with that? (Ah)\nAnd good for you, it's like you never even met me\nRemember when you swore to God I was the only\nPerson who ever got you? Well, screw that, and screw you\nYou will never have to hurt the way you know that I do\n[Chorus]\nWell, good for you\nYou look happy and healthy, not me\nIf you ever cared to ask\nGood for you\nYou're doin' great out there without me, baby\nGod, I wish that I could do that\nI've lost my mind, I've spent the night\nCryin' on the floor of my bathroom\nBut you're so unaffected, I really don't get it\nBut I guess good for you\n[Break]\n(Ah-ah-ah-ah)\n(Ah-ah-ah-ah)\n[Bridge]\nMaybe I'm too emotional\nBut your apathy's like a wound in salt\nMaybe I'm too emotional\nOr maybe you never cared at all\nMaybe I'm too emotional\nYour apathy is like a wound in salt\nMaybe I'm too emotional\nOr maybe you never cared at all\n[Chorus]\nWell, good for you\nYou look happy and healthy, not me\nIf you ever cared to ask\nGood for you\nYou're doin' great out there without me, baby\nLike a damn sociopath\nI've lost my mind, I've spent the night\nCryin' on the floor of my bathroom\nBut you're so unaffected, I really don't get it\nBut I guess good for you\n[Outro]\nWell, good for you, I guess you moved on really easily"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-vampire-lyrics",
    "lyrics": "225 Contributors\nTranslations\nEspañol\nFrançais\nDeutsch\nPortuguês\nShqip\n简体中文 (Simplified Chinese)\n日本語 (Japanese)\nItaliano\nTürkçe\n한국어 (Korean)\nРусский (Russian)\nPolski\nУкраїнська\nالعربية\nSvenska\nBahasa Indonesia\nفارسی\nNederlands\nČesky\nhrvatski\nБеларуская\nsrpski\nCatalà\nvampire Lyrics\n“vampire” doubles as the lead single from Olivia Rodrigo’s sophomore album, GUTS, as well as her comeback single following the release of her debut album, SOUR, in 2021. A small number of lyrics for the track… \nRead More\n \n[Verse 1]\nHate to give the satisfaction asking how you're doing now\nHow's the castle built off people you pretend to care about?\nJust what you wanted\nLook at you, cool guy, you got it\nI see the parties and the diamonds sometimes when I close my eyes\nSix months of torture you sold as some forbidden paradise\nI loved you truly\nYou gotta laugh at the stupidity\n[Chorus]\n'Cause I've made some real big mistakes\nBut you make the worst one look fine\nI should've known it was strange\nYou only come out at night\nI used to think I was smart\nBut you made me look so naive\nThe way you sold me for parts\nAs you sunk your teeth into me, oh\nBloodsucker, fame fucker\nBleedin' me dry like a goddamn vampire\n[Verse 2]\nAnd every girl I ever talked to told me you were bad, bad news\nYou called them crazy, God, I hate the way I called 'em crazy too\nYou're so convincing\nHow do you lie without flinching? (How do you lie? How do you lie? How do you lie?)\nOh, what a mesmerizing, paralyzing, fucked up little thrill\nCan't figure out just how you do it and God knows I never will\nWent for me and not her\n'Cause girls your age know better\n[Chorus]\nI've made some real big mistakes\nBut you make the worst one look fine\nI should've known it was strange\nYou only come out at night\nI used to think I was smart\nBut you made me look so naive\nThe way you sold me for parts\nAs you sunk your teeth into me, oh\nBloodsucker, fame fucker\nBleedin' me dry like a goddamn vampire\n[Bridge]\n(Ah)\nYou said it was true love, but wouldn't that be hard?\nYou can't love anyone 'cause that would mean you had a heart\nI tried to help you out, now I know that I can't\n'Cause how you think's the kind of thing I'll never understand\n[Chorus]\nI've made some real big mistakes\nBut you make the worst one look fine\nI should've known it was strange\nYou only come out at night\nI used to think I was smart\nBut you made me look so naive\nThe way you sold me for parts\nAs you sunk your teeth into me, oh\nBloodsucker, fame fucker\nBleedin' me dry like a goddamn vampire"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-all-i-want-lyrics",
    "lyrics": "82 Contributors\nTranslations\nEspañol\nItaliano\nDeutsch\nFrançais\nNederlands\nDansk\nРусский (Russian)\nAll I Want Lyrics\n“All I Want” was written by Olivia Rodrigo for her role in the Disney+ show High School Musical: The Musical: The Series. In the fourth episode, Rodrigo’s character, Nini, sings the song while reflecting on… \nRead More\n \n[Verse 1]\nI found a guy, told me I was a star\nHe held the door, held my hand in the dark\nAnd he's perfect on paper, but he's lying to my face\nDoes he think that I'm the kinda girl who needs to be saved?\n[Verse 2]\nAnd there's one more boy, he's from my past\nWe fell in love, but it didn't last\n'Cause the second I figure it out, he pushes me away\nAnd I won't fight for love if you won't meet me halfway\nAnd I say that I'm through, but this song's still for you\n[Chorus]\nAll I want is love that lasts\nIs all I want too much to ask?\nIs it something wrong with me?\nAll I want is a good guy\nAre my expectations far too high?\nTry my best, but what can I say?\nAll I have is myself at the end of the day\nBut shouldn't that be enough for me?\n[Bridge]\nOoh-ooh-ooh-ooh, ooh-ooh\nAnd I miss the days when I was young and naive\nI thought the perfect guy would come and find me\nNow happy ever after, it don't come so easily\n[Chorus]\nAll I want is love that lasts\nIs all I want too much to ask?\nIs it something wrong with me? Oh, ooh\nAll I want is a good guy\nAre my expectations far too high?\nTry my best, but what can I say?\nAll I have is myself at the end of the day\nAnd all I want is for that to be okay"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-happier-lyrics",
    "lyrics": "145 Contributors\nTranslations\nTürkçe\nEspañol\nPortuguês\nPortuguês\nDeutsch\nFrançais\nРусский (Russian)\nsrpski\nالعربية\nItaliano\nPolski\nNederlands\nČesky\nhappier Lyrics\nIn “happier,” Olivia wishes the best for an ex-lover and their new relationship, but simultaneously hopes to remain a significant memory in their life.\n\nThe whole album of SOUR centers on the loss of a lover.… \nRead More\n \n[Verse 1]\nWe broke up a month ago\nYour friends are mine, you know I know\nYou've moved on, found someone new\nOne more girl who brings out the better in you\nAnd I thought my heart was detached\nFrom all the sunlight of our past\nBut she's so sweet, she's so pretty\nDoes she mean you forgot about me?\n[Chorus]\nOh, I hope you're happy\nBut not like how you were with me\nI'm selfish, I know, I can't let you go\nSo find someone great, but don't find no one better\nI hope you're happy, but don't be happier\n[Verse 2]\nAnd do you tell her she's the most beautiful girl you've ever seen?\nAn eternal love bullshit you know you'll never mean\nRemember when I believed\nYou meant it when you said it first to me?\nAnd now I'm pickin' her apart\nLike cuttin' her down will make you miss my wretched heart\nBut she's beautiful, she looks kind\nShe probably gives you butterflies\n[Chorus]\nI hope you're happy\nBut not like how you were with me\nI'm selfish, I know, I can't let you go\nSo find someone great, but don't find no one better\nI hope you're happy\nI wish you all the best, really\nSay you love her, baby, just not like you loved me\nAnd think of me fondly when your hands are on her\nI hope you're happy, but don't be happier\n[Bridge]\nOoh, ooh-ooh\nOoh-ooh, ooh-ooh\n[Chorus]\nI hope you're happy\nJust not like how you were with me\nI'm selfish, I know, can't let you go\nSo find someone great, but don't find no one better\nI hope you're happy, but don't be happier"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-traitor-lyrics",
    "lyrics": "181 Contributors\nTranslations\nTürkçe\nEspañol\nPortuguês\nDeutsch\nFrançais\nMagyar\nItaliano\nDansk\n繁體中文 (Traditional Chinese)\nPortuguês\nРусский (Russian)\nالعربية\nPolski\nNederlands\nČesky\nsrpski\ntraitor Lyrics\nOn the aptly titled “traitor,” Olivia Rodrigo reflects on what went wrong in a past relationship, the feeling of being betrayed, and still missing what she had. She follows the same ideas in some of her other… \nRead More\n \n[Intro]\nOoh-ooh-ooh\nAh-ah-ah-ah-ah\n[Verse 1]\nBrown guilty eyes and little white lies, yeah\nI played dumb, but I always knew\nThat you talked to her, maybe did even worse\nI kept quiet so I could keep you\n[Pre-Chorus]\nAnd ain't it funny how you ran to her\nThe second that we called it quits?\nAnd ain't it funny how you said you were friends?\nNow it sure as hell don't look like it\n[Chorus]\nYou betrayed me\nAnd I know that you'll never feel sorry\nFor the way I hurt, yeah\nYou talked to her when we were together\nLoved you at your worst, but that didn't matter\nIt took you two weeks to go off and date her\nGuess you didn't cheat, but you're still a traitor\n[Verse 2]\nNow you bring her around just to shut me down\nShow her off like she's a new trophy\nAnd I know if you were true, there's no damn way that you\nCould fall in love with somebody that quickly\n[Pre-Chorus]\nAnd ain't it funny? All the twisted games\nAll the questions you used to avoid\nAin't it funny? Remember I brought her up\nAnd you told me I was paranoid?\n[Chorus]\nYou betrayed me\nAnd I know that you'll never feel sorry\nFor the way I hurt, yeah\nYou talked to her when we were together\nLoved you at your worst, but that didn't matter\nIt took you two weeks to go off and date her\nGuess you didn't cheat, but you're still a traitor\n[Bridge]\n(Ah-ah-ah)\nGod, I wish that you had thought this through\nBefore I went and fell in love with you\n(Ah-ah-ah)\nWhen she's sleepin' in the bed we made\nDon't you dare forget about the way\n[Chorus]\nYou betrayed me\n'Cause I know that you'll never feel sorry\nFor the way I hurt, yeah\nYou talked to her when we were together\nYou gave me your word, but that didn't matter\nIt took you two weeks to go off and date her\nGuess you didn't cheat, but you're still, you're still a traitor\n(Ah-ah-ah)\nYeah, you're still a traitor\n[Outro]\nOoh-ooh-ooh\nGod, I wish that you had thought this through\nBefore I went and fell in love with you"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-the-grudge-lyrics",
    "lyrics": "108 Contributors\nTranslations\nSvenska\nTürkçe\nPortuguês\nEspañol\nFrançais\nالعربية\nУкраїнська\nItaliano\nРусский (Russian)\nDeutsch\nČesky\nNederlands\nsrpski\nCatalà\nBahasa Indonesia\nPolski\nthe grudge Lyrics\nIn “the grudge,” Olivia paints a vivid picture of a relationship marked by manipulation and emotional turmoil. The song reflects the struggle Olivia faces, torn between feelings of deceit and conflicting… \nRead More\n \n[Verse 1]\nI have nightmares each week 'bout that Friday in May\nOne phone call from you and my entire world was changed\nTrust that you betrayed, confusion that still lingers\nTook everything I loved and crushed it in between your fingers\nAnd I doubt you ever think about the damage that you did\nBut I hold onto every detail like my life depends on it\nMy undying love, now, I hold it like a grudge\nAnd I hear your voice every time that I think I'm not enough\n[Chorus]\nAnd I try to be tough, but I wanna scream\nHow could anybody do the things you did so easily?\nAnd I say I don't care, I say that I'm fine\nBut you know I can't let it go, I've tried, I've tried, I've tried for so long\nIt takes strength to forgive, but I don't feel strong\n[Verse 2]\nThe arguments that I've won against you in my head\nIn the shower, in the car, and in the mirror before bed\nYeah, I'm so tough when I'm alone, and I make you feel so guilty\nAnd I fantasize about a time you're a little fuckin' sorry\nAnd I try to understand why you would do this all to me\nYou must be insecure, you must be so unhappy\nAnd I know, in my heart, hurt people hurt people\nAnd we both drew blood, but, man, those cuts were never equal\n[Chorus]\nAnd I try to be tough, but I wanna scream\nHow could anybody do the things you did so easily?\nAnd I say I don't care, I say that I'm fine\nBut you know I can't let it go, I've tried, I've tried, I've tried for so long\nIt takes strength to forgive, but I don't feel strong\n[Bridge]\nOoh, do you think I deserved it all?\nOoh, your flowers filled with vitriol\nYou built me up to watch me fall\nYou have everything, and you still want more\n[Outro]\nI try to be tough, I try to be mean\nBut even after all this, you're still everything to me\nAnd I know you don't care, I guess that that's fine\nBut you know I can't let it go\n, I've tried, I've tried, I've tried for so long\nIt takes strength to forgive, but I'm not quite sure I'm there yet\nIt takes strength to forgive, but"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-lacy-lyrics",
    "lyrics": "103 Contributors\nTranslations\nSvenska\nTürkçe\nPortuguês\nEspañol\nFrançais\nالعربية\nsrpski\nУкраїнська\nDeutsch\nItaliano\nفارسی\nNederlands\nРусский (Russian)\nCatalà\nBahasa Indonesia\nPolski\nlacy Lyrics\n“lacy,” the fourth track of GUTS, sees Olivia blur the line between envy and homoeroticism.\n\nIn one lens, Rodrigo embraces her inferiority complex by personifying the beauty of women she’s intimidated by in… \nRead More\n \n[Verse 1]\nLacy, oh Lacy, skin like puff pastry\nAren't you the sweetest thing on this side of Hell?\nDear angel Lacy, eyes white as daisies\nDid I ever tell you that I’m not doin' well?\n[Chorus]\nOoh, I care, I care, I care\nLike perfume that you wear, I linger all the time\nWatching, hidden in plain sight\nAnd ooh, I try, I try, I try\nBut it takes over my life, I see you everywhere\nThe sweetest torture one could bear\n[Verse 2]\nSmart, sexy Lacy, I'm losin’ it lately\nI feel your compliments likе bullets on skin\nDazzling starlet, Bardot reincarnatе\nWell, aren't you the greatest thing to ever exist?\n[Chorus]\nOoh, I care, I care, I care\nLike ribbons in your hair, my stomach's all in knots\nYou got the one thing that I want\nOoh, I try, I try, I try\nTry to rationalize, people are people\nBut it's like you're made of angel dust\n[Bridge]\nOh, oh, oh\nOh, oh, oh, oh\nOh, oh, oh, oh\nOh, oh, oh\n[Outro]\nLacy, oh Lacy, it's like you're out to get me\nYou poison every little thing that I do\nLacy, oh Lacy, I just loathe you lately\nAnd I despise my jealous eyes and how hard they fell for you\nYeah, I despise my rotten mind and how much it worships you"
  },
  {
    "artist": "Olivia-rodrigo",
    "song_url": "https://genius.com/Olivia-rodrigo-get-him-back-lyrics",
    "lyrics": "141 Contributors\nTranslations\nSvenska\nTürkçe\nEspañol\nالعربية\nFrançais\nPortuguês\nУкраїнська\nDeutsch\nItaliano\nBahasa Indonesia\nČesky\nNederlands\nhrvatski\nsrpski\nPolski\nРусский (Russian)\nБеларуская\nCatalà\nget him back! Lyrics\n“get him back!” is the pop-rock, regretful track describing Rodrigo’s want to get a boy back who she previously dated. She decides to do this in a more ‘sinister’ way by tricking him into making him jealous… \nRead More\n \n[Intro: Alexander 23]\nOne, two, three\nWait, is this the song with the drums?\n[Verse 1]\nI met a guy in the summer, and I left him in the spring\nHe argued with me about everything\nHe had an ego and a temper and a wandering eye\nHe said he's six-foot-two, and I'm like, \"Dude, nice try\"\nBut he was so much fun, and he had such weird friends\nAnd he would take us out to parties, and the night would never end\nAnother song, another club, another bar, another dance\nAnd when hе said something wrong, he'd just fly me to Francе\nSo I miss him some nights when I'm feeling depressed\n'Til I remember every time he made a pass on my friend\nDo I love him? Do I hate him? I guess it's up and down\nIf I had to choose, I would say right now\n[Chorus]\nI wanna get him back\nI wanna make him really jealous, wanna make him feel bad\nOh, I wanna get him back\n'Cause then again, I really miss him, and it makes me real sad\nOh, I want sweet revenge, and I want him again\nI want to get him back, back, back\n[Verse 2]\nSo I write him all these letters, and I throw them in the trash\n'Cause I miss the way he kisses and the way he made me laugh\nYeah, I pour my little heart out, but as I'm hitting \"send\"\nI picture all the faces of my disappointed friends\nBecause everyone knew all of the shit that he'd do\nHe said I was the only girl, but that just wasn't the truth\nAnd when I told him how he hurt me, he'd tell me I was trippin'\nBut I am my father's daughter, so maybe I could fix him\n[Chorus]\nI wanna get him back\nI wanna make him really jealous, wanna make him feel bad\nOh, I wanna get him back\n'Cause then again, I really miss him, and it makes me real sad\nOh, I want sweet revenge, and I want him again\nI want to get him back\n \n(And then? And then)\nI want to get him back, back, back\n[Bridge: Olivia Rodrigo, \nAlexander 23\n]\nI wanna key his car (I want to get him back)\nI wanna make him lunch (But then I, I want to get him back; \nWoo\n)\nI wanna break his heart (But then I, I want to get him back; \nYeah, you got it\n)\nThen be the one to stitch it up (But then I, I want to get him back; \nyeah\n)\nWanna kiss his face (But then I, I want to get him back)\nWith an uppercut (But then I, I want to get him back)\nI wanna meet his mom (But then I, I want to get him back)\nJust to tell her her son sucks (But then I, I want to get him back)\nOh, I wanna key his car, I wanna make him lunch (But then I, I want to get him back; I want to)\nI wanna break his heart, stitch it right back up (But then I, I want to get him back; get him back)\nI wanna kiss his face with an uppercut (But then I, I want to get him back; I want to)\nI wanna meet his mom, and tell her her son sucks, yeah (But then I, I want to get him back; get him back)\n[Chorus]\nI wanna get him back\nI wanna make him really jealous, wanna make him feel bad\nOh, I wanna get him back\n'Cause then again, I really miss him, and it makes me real sad\nOh, I want sweet revenge, and I want him again\nI want to get him back\n \n(And then? And then)\nI want to get him back, back, back\n[Outro: Olivia Rodrigo, \nChappell Roan\n, \nAlexander 23\n & \nDan Nigro\n]\nI'll get him, I'll get him, I'll get him, I'll get him back (\nWoo-hoo\n)\nGet him back (\nCome on, come on, woo\n)\nI'm gonna get him so good, he's not even gonna know what hit him\nHe's gonna love me and hate me at the same time\n(\nGet him back, girl, you better get him back\n)\n(\nYou got it\n, \ngot him\n)\nOh, I don't know, I got him good, I got him really good"
  }
]